Week1MiniProject/app/controllers/articles_controller.rb

  def index
    # fetch all articles from the database
    @articles = Article.all
---
SELECT "articles".* FROM "articles"